tiborsimon/embedded-tdd-headers/pic/8bit/pic18f2410_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F2410_H_
#define _PIC18F2410_H_

#define PORTA                         0
#define AN0                           1
#define ULPWUIN                       2
#define PORTA_RA0                     3
#define AN1                           4
#define PORTA_RA1                     5
#define AN2                           6
#define PORTA_RA2                     7
#define CVREF                         8
#define VREFN                         9
#define AN3                           10
#define PORTA_RA3                     11
#define VREFP                         12
#define PORTA_RA4                     13
#define T0CKI                         14
#define AN4                           15
#define PORTA_RA5                     16
#define LVDIN                         17
#define nSS                           18
#define NOT_SS                        19
#define SS                            20
#define HLVDIN                        21
#define CLKO                          22
#define PORTA_RA6                     23
#define OSC2                          24
#define CLKI                          25
#define PORTA_RA7                     26
#define OSC1                          27
#define RJPU                          28
#define PORTB                         29
#define INT0                          30
#define PORTB_RB0                     31
#define AN12                          32
#define INT1                          33
#define PORTB_RB1                     34
#define AN10                          35
#define AN8                           36
#define INT2                          37
#define PORTB_RB2                     38
#define AN9                           39
#define PORTB_CCP2                    40
#define CCP2_PA2                      41
#define PORTB_RB3                     42
#define KBI0                          43
#define PORTB_RB4                     44
#define AN11                          45
#define PGM                           46
#define PORTB_RB5                     47
#define KBI1                          48
#define PGC                           49
#define PORTB_RB6                     50
#define KBI2                          51
#define PGD                           52
#define PORTB_RB7                     53
#define KBI3                          54
#define PORTC                         55
#define T13CKI                        56
#define T1CKI                         57
#define T1OSO                         58
#define PORTC_RC0                     59
#define PORTC_CCP2                    60
#define T1OSI                         61
#define PA2                           62
#define PORTC_RC1                     63
#define CCP1                          64
#define PA1                           65
#define PORTC_RC2                     66
#define SCL                           67
#define SCK                           68
#define PORTC_RC3                     69
#define SDA                           70
#define SDI                           71
#define PORTC_RC4                     72
#define SDO                           73
#define PORTC_RC5                     74
#define TX                            75
#define CK                            76
#define PORTC_RC6                     77
#define DT                            78
#define RX                            79
#define PORTC_RC7                     80
#define PORTE                         81
#define VPP                           82
#define RE3                           83
#define NOT_MCLR                      84
#define MCLR                          85
#define CCP9E                         86
#define nMCLR                         87
#define PC3E                          88
#define LATA                          89
#define LATA0                         90
#define LA0                           91
#define LATA1                         92
#define LA1                           93
#define LATA2                         94
#define LA2                           95
#define LATA3                         96
#define LA3                           97
#define LATA4                         98
#define LA4                           99
#define LATA5                         100
#define LA5                           101
#define LATA6                         102
#define LA6                           103
#define LATA7                         104
#define LA7                           105
#define LATB                          106
#define LB0                           107
#define LATB0                         108
#define LB1                           109
#define LATB1                         110
#define LB2                           111
#define LATB2                         112
#define LB3                           113
#define LATB3                         114
#define LB4                           115
#define LATB4                         116
#define LB5                           117
#define LATB5                         118
#define LB6                           119
#define LATB6                         120
#define LB7                           121
#define LATB7                         122
#define LATC                          123
#define LATC0                         124
#define LC0                           125
#define LATC1                         126
#define LC1                           127
#define LATC2                         128
#define LC2                           129
#define LATC3                         130
#define LC3                           131
#define LATC4                         132
#define LC4                           133
#define LATC5                         134
#define LC5                           135
#define LATC6                         136
#define LC6                           137
#define LATC7                         138
#define LC7                           139
#define TRISA                         140
#define TRISA0                        141
#define TRISA_RA0                     142
#define TRISA1                        143
#define TRISA_RA1                     144
#define TRISA2                        145
#define TRISA_RA2                     146
#define TRISA3                        147
#define TRISA_RA3                     148
#define TRISA_RA4                     149
#define TRISA4                        150
#define TRISA_RA5                     151
#define TRISA5                        152
#define TRISA_RA6                     153
#define TRISA6                        154
#define TRISA_RA7                     155
#define TRISA7                        156
#define TRISB                         157
#define TRISB_RB0                     158
#define TRISB0                        159
#define TRISB_RB1                     160
#define TRISB1                        161
#define TRISB_RB2                     162
#define TRISB2                        163
#define TRISB_RB3                     164
#define TRISB3                        165
#define TRISB_RB4                     166
#define TRISB4                        167
#define TRISB_RB5                     168
#define TRISB5                        169
#define TRISB_RB6                     170
#define TRISB6                        171
#define TRISB_RB7                     172
#define TRISB7                        173
#define TRISC                         174
#define TRISC0                        175
#define TRISC_RC0                     176
#define TRISC1                        177
#define TRISC_RC1                     178
#define TRISC2                        179
#define TRISC_RC2                     180
#define TRISC3                        181
#define TRISC_RC3                     182
#define TRISC4                        183
#define TRISC_RC4                     184
#define TRISC5                        185
#define TRISC_RC5                     186
#define TRISC6                        187
#define TRISC_RC6                     188
#define TRISC7                        189
#define TRISC_RC7                     190
#define OSCTUNE                       191
#define TUN0                          192
#define TUN                           193
#define TUN1                          194
#define TUN2                          195
#define TUN3                          196
#define TUN4                          197
#define PLLEN                         198
#define INTSRC                        199
#define PIE1                          200
#define TMR1IE                        201
#define TMR2IE                        202
#define CCP1IE                        203
#define SSPIE                         204
#define TXIE                          205
#define TX1IE                         206
#define RCIE                          207
#define RC1IE                         208
#define ADIE                          209
#define PIR1                          210
#define TMR1IF                        211
#define TMR2IF                        212
#define CCP1IF                        213
#define SSPIF                         214
#define TXIF                          215
#define TX1IF                         216
#define RCIF                          217
#define RC1IF                         218
#define ADIF                          219
#define IPR1                          220
#define TMR1IP                        221
#define TMR2IP                        222
#define CCP1IP                        223
#define SSPIP                         224
#define TX1IP                         225
#define TXIP                          226
#define RC1IP                         227
#define RCIP                          228
#define ADIP                          229
#define PIE2                          230
#define CCP2IE                        231
#define TMR3IE                        232
#define HLVDIE                        233
#define LVDIE                         234
#define BCLIE                         235
#define CMIE                          236
#define OSCFIE                        237
#define PIR2                          238
#define CCP2IF                        239
#define TMR3IF                        240
#define HLVDIF                        241
#define LVDIF                         242
#define BCLIF                         243
#define CMIF                          244
#define OSCFIF                        245
#define IPR2                          246
#define CCP2IP                        247
#define TMR3IP                        248
#define HLVDIP                        249
#define LVDIP                         250
#define BCLIP                         251
#define CMIP                          252
#define OSCFIP                        253
#define RCSTA                         254
#define RCD8                          255
#define RX9D                          256
#define OERR                          257
#define FERR                          258
#define ADDEN                         259
#define ADEN                          260
#define CREN                          261
#define SRENA                         262
#define SREN                          263
#define RC9                           264
#define RC8_9                         265
#define RX9                           266
#define SPEN                          267
#define TXSTA                         268
#define TXD8                          269
#define TX9D1                         270
#define TX9D                          271
#define TRMT                          272
#define TRMT1                         273
#define BRGH1                         274
#define BRGH                          275
#define SENDB1                        276
#define SENDB                         277
#define SYNC                          278
#define SYNC1                         279
#define TXEN1                         280
#define TXEN                          281
#define TX91                          282
#define TX8_9                         283
#define TX9                           284
#define CSRC1                         285
#define CSRC                          286
#define T3CON                         287
#define TMR3ON                        288
#define TMR3CS                        289
#define nT3SYNC                       290
#define NOT_T3SYNC                    291
#define T3SYNC                        292
#define SOSCEN3                       293
#define T3CCP1                        294
#define T3CKPS                        295
#define T3CKPS0                       296
#define T3CKPS1                       297
#define T3CCP2                        298
#define T3CON_RD16                    299
#define RD163                         300
#define T3RD16                        301
#define CMCON                         302
#define CM                            303
#define CMEN0                         304
#define CM0                           305
#define CMEN1                         306
#define CM1                           307
#define CMEN2                         308
#define CM2                           309
#define CIS                           310
#define C1INV                         311
#define C2INV                         312
#define C1OUT                         313
#define C2OUT                         314
#define CVRCON                        315
#define CVR                           316
#define CVR0                          317
#define CVR1                          318
#define CVR2                          319
#define CVR3                          320
#define CVRSS                         321
#define CVRR                          322
#define CVROEN                        323
#define CVROE                         324
#define CVREN                         325
#define ECCP1AS                       326
#define PSSAC                         327
#define PSSAC0                        328
#define PSSAC1                        329
#define ECCPAS0                       330
#define ECCPAS                        331
#define ECCPAS1                       332
#define ECCPAS2                       333
#define ECCPASE                       334
#define PWM1CON                       335
#define PRSEN                         336
#define BAUDCON                       337
#define ABDEN                         338
#define W4E                           339
#define WUE                           340
#define BRG16                         341
#define TXCKP                         342
#define SCKP                          343
#define RXCKP                         344
#define RXDTP                         345
#define RCMT                          346
#define RCIDL                         347
#define ABDOVF                        348
#define CCP2CON                       349
#define CCP2M                         350
#define CCP2M0                        351
#define CCP2M1                        352
#define CCP2M2                        353
#define CCP2M3                        354
#define DC2B0                         355
#define CCP2Y                         356
#define DC2B                          357
#define DC2B1                         358
#define CCP2X                         359
#define CCP1CON                       360
#define CCP1M0                        361
#define CCP1M                         362
#define CCP1M1                        363
#define CCP1M2                        364
#define CCP1M3                        365
#define CCP1Y                         366
#define DC1B                          367
#define DC1B0                         368
#define CCP1X                         369
#define DC1B1                         370
#define ADCON2                        371
#define ADCS0                         372
#define ADCS                          373
#define ADCS1                         374
#define ADCS2                         375
#define ACQT0                         376
#define ACQT                          377
#define ACQT1                         378
#define ACQT2                         379
#define ADFM                          380
#define ADCON1                        381
#define PCFG0                         382
#define PCFG                          383
#define PCFG1                         384
#define PCFG2                         385
#define CHSN3                         386
#define PCFG3                         387
#define VCFG                          388
#define VCFG0                         389
#define VCFG01                        390
#define VCFG11                        391
#define VCFG1                         392
#define ADCON0                        393
#define ADON                          394
#define nDONE                         395
#define GO_nDONE                      396
#define NOT_DONE                      397
#define GODONE                        398
#define GO_DONE                       399
#define DONE                          400
#define GO_NOT_DONE                   401
#define GO                            402
#define CHS                           403
#define CHS0                          404
#define CHS1                          405
#define CHS2                          406
#define CHS3                          407
#define SSPCON2                       408
#define SEN                           409
#define RSEN                          410
#define PEN                           411
#define RCEN                          412
#define ACKEN                         413
#define ACKDT                         414
#define ACKSTAT                       415
#define GCEN                          416
#define SSPCON1                       417
#define SSPM0                         418
#define SSPM                          419
#define SSPM1                         420
#define SSPM2                         421
#define SSPM3                         422
#define CKP                           423
#define SSPEN                         424
#define SSPOV                         425
#define WCOL                          426
#define SSPSTAT                       427
#define BF                            428
#define UA                            429
#define R_NOT_W                       430
#define NOT_W                         431
#define nW                            432
#define RW                            433
#define nWRITE                        434
#define R                             435
#define W                             436
#define NOT_WRITE                     437
#define R_nW                          438
#define R_W                           439
#define START                         440
#define S                             441
#define STOP                          442
#define P                             443
#define A                             444
#define NOT_A                         445
#define nA                            446
#define D_A                           447
#define D_nA                          448
#define D                             449
#define DA                            450
#define D_NOT_A                       451
#define NOT_ADDRESS                   452
#define nADDRESS                      453
#define CKE                           454
#define SMP                           455
#define T2CON                         456
#define T2CKPS0                       457
#define T2CKPS                        458
#define T2CKPS1                       459
#define TMR2ON                        460
#define T2OUTPS0                      461
#define TOUTPS0                       462
#define TOUTPS                        463
#define T2OUTPS1                      464
#define TOUTPS1                       465
#define T2OUTPS2                      466
#define TOUTPS2                       467
#define T2OUTPS3                      468
#define TOUTPS3                       469
#define PR2                           470
#define WM0                           471
#define WM1                           472
#define WAIT0                         473
#define WAIT1                         474
#define EBDIS                         475
#define T1CON                         476
#define TMR1ON                        477
#define TMR1CS                        478
#define NOT_T1SYNC                    479
#define T1SYNC                        480
#define nT1SYNC                       481
#define T1OSCEN                       482
#define SOSCEN                        483
#define T1CKPS0                       484
#define T1CKPS                        485
#define T1CKPS1                       486
#define T1RUN                         487
#define T1CON_RD16                    488
#define T1RD16                        489
#define RCON                          490
#define BOR                           491
#define NOT_BOR                       492
#define nBOR                          493
#define POR                           494
#define nPOR                          495
#define NOT_POR                       496
#define PD                            497
#define nPD                           498
#define NOT_PD                        499
#define NOT_TO                        500
#define nTO                           501
#define TO                            502
#define nRI                           503
#define NOT_RI                        504
#define RI                            505
#define SBOREN                        506
#define IPEN                          507
#define WDTCON                        508
#define SWDTE                         509
#define SWDTEN                        510
#define HLVDCON                       511
#define HLVDL                         512
#define HLVDL0                        513
#define LVV0                          514
#define LVDL0                         515
#define HLVDL1                        516
#define LVDL1                         517
#define LVV1                          518
#define HLVDL2                        519
#define LVV2                          520
#define LVDL2                         521
